LalodeAvila369/Frdmkl25z_MicrosUAZ/MKL25Z128xxx4_ProjectSemaforos_Project02/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t WGreen_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA4 (pin 30)  */
    GPIO_PinInit(BOARD_INITPINS_WGreen_GPIO, BOARD_INITPINS_WGreen_PIN, &WGreen_config);

    gpio_pin_config_t WYellow_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA12 (pin 32)  */
    GPIO_PinInit(BOARD_INITPINS_WYellow_GPIO, BOARD_INITPINS_WYellow_PIN, &WYellow_config);

    gpio_pin_config_t PeopleSense_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA13 (pin 33)  */
    GPIO_PinInit(BOARD_INITPINS_PeopleSense_GPIO, BOARD_INITPINS_PeopleSense_PIN, &PeopleSense_config);

    gpio_pin_config_t NGreen_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_NGreen_GPIO, BOARD_INITPINS_NGreen_PIN, &NGreen_config);

    gpio_pin_config_t NYellow_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_NYellow_GPIO, BOARD_INITPINS_NYellow_PIN, &NYellow_config);

    gpio_pin_config_t NRed_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_NRed_GPIO, BOARD_INITPINS_NRed_PIN, &NRed_config);

    gpio_pin_config_t NBlue_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_NBlue_GPIO, BOARD_INITPINS_NBlue_PIN, &NBlue_config);

    gpio_pin_config_t EBlue_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_EBlue_GPIO, BOARD_INITPINS_EBlue_PIN, &EBlue_config);

    gpio_pin_config_t NSense_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_NSense_GPIO, BOARD_INITPINS_NSense_PIN, &NSense_config);

    gpio_pin_config_t ERed_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_ERed_GPIO, BOARD_INITPINS_ERed_PIN, &ERed_config);

    gpio_pin_config_t EYellow_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 61)  */
    GPIO_PinInit(BOARD_INITPINS_EYellow_GPIO, BOARD_INITPINS_EYellow_PIN, &EYellow_config);

    gpio_pin_config_t EGreen_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_EGreen_GPIO, BOARD_INITPINS_EGreen_PIN, &EGreen_config);

    gpio_pin_config_t ESense_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_ESense_GPIO, BOARD_INITPINS_ESense_PIN, &ESense_config);

    gpio_pin_config_t WBlue_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 65)  */
    GPIO_PinInit(BOARD_INITPINS_WBlue_GPIO, BOARD_INITPINS_WBlue_PIN, &WBlue_config);

    gpio_pin_config_t WSense_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 66)  */
    GPIO_PinInit(BOARD_INITPINS_WSense_GPIO, BOARD_INITPINS_WSense_PIN, &WSense_config);

    gpio_pin_config_t WRed_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 77)  */
    GPIO_PinInit(BOARD_INITPINS_WRed_GPIO, BOARD_INITPINS_WRed_PIN, &WRed_config);

    gpio_pin_config_t SGreen_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE20 (pin 13)  */
    GPIO_PinInit(BOARD_INITPINS_SGreen_GPIO, BOARD_INITPINS_SGreen_PIN, &SGreen_config);

    gpio_pin_config_t SYellow_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE21 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_SYellow_GPIO, BOARD_INITPINS_SYellow_PIN, &SYellow_config);

    gpio_pin_config_t SRed_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE22 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_SRed_GPIO, BOARD_INITPINS_SRed_PIN, &SRed_config);

    gpio_pin_config_t SBlue_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE23 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_SBlue_GPIO, BOARD_INITPINS_SBlue_PIN, &SBlue_config);

